TAONAW.org
#+TITLE: TAONAW Hugo Version
#+OPTIONS: num:nil toc:nil \n:nil
#+TODO: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d

*** TODO 5 Month Review of Org-mode 
    :PROPERTIES:
    :EXPORT_HUGO_SECTION: EmacsOrg
    :EXPORT_FILE_NAME: 5months
    :EXPORT_HUGO_PUBLISHDATE: 2018-12-17:
    :END:

 According to my notes, I started using Org seriously mid August of this years. I was thinking it will be interesting to see what I learned and where I am today. 

**** Beginnings: costumizing Org and journaling

 At the beginning, my main concerns were regarding wokring with Org the way I used to previously, and journaling. Before using Org and Emacs, I used [[https://typora.io/][Typora]], which I still think is one of the best tools I've seen to writing Markdown. It was a minimalist and pretty application which I enjoyed writing my journal notes in. I tried to copy this experience into Emacs, but of course, Org comes with many organizational options Typora is not desgined to  have. 

 It took some time to get used to letting Org dealing with dates and then eventually shift to its date format (I used to write dates and times without hyphens, like 20180101:1521). I then took a nautral turn to start my transformation into a weekly mindset with org. I always prefered to work in a weekly mindset and journaled about my week going back, but now I also started to organized my todos this way and slowly started counting on my Aenda rather then just an org file for work and for personal life. This is how I stayed until today. 

**** Improving Technical Skills

Using Emacs meant looking into some techical elements that I was familair yet not comfortable with. To make Emacs mine, I had to dig deeper into its init file, learn to use org-capture, set up and use my computer as SSH server for TRAMP, and eventually, create a VM at work. All the above skills were needed to make Org mode useful for me at work, which I knew from the beginning would be the big test. 

***** Init into Org: 

The Emacs init file still looks somewhat alien and hostile to me without comments explaining what exactly each snippet of code does. Only when I shifted to Org, a task which took at least two weekends, I started being more comfortable with changing parts of my settings for different computers. This, in turn, is what allowed me to work on Emacs from a dedicated VM at work. 

Different things in my org  settings, such as the capture templates, are revisted for minior tweaks with relative ease which was not possible within the inital init file for me. I had to explain terms in my own way, not the Emacs way, to really "get it". 

***** Org Capture

Org capture

